[{"title":"Who am I?","projectName":"Dawg Coffee","projectFocus":"HTML, CSS","projectDesc":"A simple, yet relaxing webpage providing information about a hole-in-the-wall coffee shop.","projectImg":"img/dawg-coffee.png","projectLink":"http://staff.washington.edu/trosane/dawg-coffee/index.html","class":"Web Application Security","classInfo":"Hands on assignments cover the main vulnerabilities to web applications, such as cross-site scripting, SQL injection and cross-site request forgery. Other topics touched upon include buffer overflows, crytography and remote file inclusion.","trait":"Web Developer","traitDesc":"My experience with web development includes working on class projects that helped me build foundations in HTML, CSS, JavaScript and AngularJS, as well as working with APIs.","traitIcon":"https://www.ardentcreative.com/wp-content/uploads/2013/06/color_web-design-icon.png"},
{"title":"Projects","projectName":"Police Shootings","projectFocus":"JavaScript, jQuery, Leaflet.js","projectDesc":"An informative, interactive site that allows users to interact with a map and view data about police shootings in the United States.","projectImg":"img/police-shooting.png","projectLink":"http://staff.washington.edu/trosane/police-shooting/index.html","class":"Client Side Web Development","classInfo":"Introduction to client-side web development including markup, programming, protocols, libraries, frameworks, and techniques for creating effective, usable, dynamic, and responsive applications that meet user needs. Includes an introduction to web development roles within organizations, content management systems, and other tools to build and manage websites and applications.","trait":"Security Enthusiast","traitDesc":"I am very interested in cyber security and have experience working with and pentesting vulnerable sites. I am also currently studying for my CompTIA Security+ certification.","traitIcon":"https://www.secureworldexpo.com/sites/secureworld/files/Cybersecurity%20Icon%20-%20Labeled%20for%20Reuse.jpg"},
{"title":"About","projectName":"Product Review","projectFocus":"JavaScript, Parse","projectDesc":"This site is a mock review site that allows users to post their opinions on the product, rate it and upvote/downvote other reviews.","projectImg":"img/review.png","projectLink":"http://staff.washington.edu/trosane/CRUD/index.html","class":"Introduction to Data Science","classInfo":"Surveys the major topics within data science, including data ingestion, cloud computing, statistical inference, machine learning, information visualization, and data ethics. Includes programming in R and python.","trait":"Designer","traitDesc":"Through multiple projects, I have learned about the application design process, such a wireframing, prototyping and user testing.","traitIcon":"http://essexwebsitestudio.com/wp-content/uploads/2015/06/web_design-icon.png"},
{"title":"Contact","projectName":"Spotify Song Search","projectFocus":"Angular.js, Spotify API","projectDesc":"A simplistic site that provides users a platform to easily search for songs in the Spotify library by searching through artists and albums.","projectImg":"img/spotify.png","projectLink":"http://staff.washington.edu/trosane/spotify-template/index.html","class":"Introduction to Relational Databases","classInfo":"Introduction to relational database management systems, focused on relational theory and the application of conceptual, logical, and physical database modeling. Key topics include the relational model, SQL, entity-relationship modeling, three-tier architectures, implementation of database applications, and related topics in information systems.","trait":"","traitDesc":"","traitIcon":""},
{"title":"","projectName":"Fifteen Puzzle","projectFocus":"JavaScript, jQuery","projectDesc":"A web version of the classic fifteen puzzle, where users attempt to make a picture by moving one tile at a time.","projectImg":"img/fifteen.jpg","projectLink":"http://staff.washington.edu/trosane/cse154/HW8/fifteen.html","class":"Data Structures & Algorithms","classInfo":"Fundamental algorithms and data structures for implementation. Techniques for solving problems by programming. Linked lists, stacks, queues, directed graphs. Trees: representations, traversals. Searching (hashing, binary search trees, multiway trees). Garbage collection, memory management. Internal and external sorting.","trait":"","traitDesc":"","traitIcon":""}]